# HemisphericalLightDistribution Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HemisphericalLightDistribution Class
Members See Also
---
This class encapsulates a hemispherical light distribution.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class HemisphericalLightDistribution : LightDistribution
```

Visual Basic
---
```text
Public Class HemisphericalLightDistribution _
	Inherits LightDistribution
```

Visual C++
---
```text
public ref class HemisphericalLightDistribution : public LightDistribution
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..LightDistribution Autodesk.Revit.DB.Lighting..::..HemisphericalLightDistribution
# See Also
HemisphericalLightDistribution Members
Autodesk.Revit.DB.Lighting Namespace